import React from "react";

export default function SundayCollege() {
    return (
        <section className="flex w-full flex-col bg-white p-3 md:p-10">
            <h2 className="md:px-10 py-4 text-center text-4xl">
                <span className="text-5xl font-bold">
                    Неделен бизнес колеж{" "}
                </span>
                - кариерно професионално ориентиране за икономическа култура.
                Неделно обучение за млади хора с амбиции за печелившо поведение.
            </h2>
            <img src="/headers/sundayCollege.png" className="h-auto w-full" />
            <div className="p-5">
                <h4 className="text-4xl">
                    Присъединете се към нашата 3-месечна програма за млади хора
                    с амбиции за реализация в бизнеса.
                </h4>
                <div className="p-2">
                    <h5 className="text-3xl">Модули:</h5>
                    <ul className="list-decimal px-10 py-2 text-lg">
                        <li>
                            Икономически основи за успешен старт във всяка
                            кариера
                        </li>
                        <li>
                            Финансова грамотност като ръководство за овладяване
                            на играта на парите.
                        </li>
                        <li>
                            Банки и банкови стратегии за личен и професионален
                            успех.
                        </li>
                        <li>
                            Бизнес комуникации - как да създадем връзки и
                            доверие - синхронизиране на нивата на лично и
                            професионално общуване.
                        </li>
                        <li>
                           Основи на счедоводството - Счедоводство за финансова устойчивост и развитие.
                        </li>
                    </ul>
                </div>
                <div className="flex flex-col gap-3 text-xl">
                    <p>
                        Преподавателите са от състава на икономически
                        университети във Варна и София, ЧТГ “Конто трейд” ЕООД,
                        както и действащи специалисти в областта на банковото
                        дело и търговското право.
                    </p>
                    <p>
                        Всеки курс се специализира в предложена, избрана от него
                        консултантска дейност и му се предоставя подходящ
                        практикум в български и чуждестранни фирми и
                        представителства на консорциума.Образователният
                        консорциум “(EduFutureSkills)” , който е главен
                        организатор на тази иновация във Варна.
                    </p>
                    <p>Курсът е за младежи между 16 и 22 години.</p>
                    <p>
                        Регистрирайте се до 29-ти февруари за специална цена от
                        450 лева. След тази дата цената е 560 лева.
                    </p>
                    <p>
                        За повече информация, моля обадете се на тел.{" "}
                        <a
                            href="tel:+359893344538"
                            className="cursor-pointer text-blue-500 underline"
                        >
                            +359 89 33 44 538/9.
                        </a>
                    </p>
                </div>
            </div>
        </section>
    );
}
